{
  "id": "all-my-favorite-songs-011-thurston-moore",
  "title": "All My Favorite Songs 011 by Thurston Moore - Favorite songs of all time",
  "timestamp": 1636025696,
  "webpage_url": "http://allmyfavoritesongs.com#011",
  "description": "Thurston Joseph Moore (born July 25, 1958) is an American musician best known as a member of Sonic Youth. He has also participated in many solo and group collaborations outside Sonic Youth, as well as running the Ecstatic Peace! record label. Thurston Moore's work with Sonic Youth rearranged the parameters of indie rock to an almost incalculable degree, merging experimental art rock tendencies with unconventional guitar tunings for a sound that would influence generations to come. Moore's abstract poetic lyrics and perpetually mysterious aura were core ingredients of Sonic Youth's 30-plus-year run, but also bled into countless side projects and less-frequent solo albums like 1994's sprawling and loose Psychic Hearts. After the group's breakup in 2011, Moore continued with his ambitions, ranging from projects like his band Chelsea Light Moving to noisy collaborations with Merzbow and John Zorn to solo albums like 2020's By the Fire that continued exploring the kind of moody, twisting art rock he'd become an icon of with Sonic Youth. Moore was ranked 34th in Rolling Stone's 2004 edition of the '100 Greatest Guitarists of All Time.' In May 2012, Spin published a staff-selected list of the top 100 rock guitarists, and ranked Moore and his Sonic Youth bandmate Lee Ranaldo together at number 1.  \n\n Lineup:\n Tapper Zukie, Patti Smith, Teenage Jesus & The Jerks, MARS, Public Image Ltd., The Slits, The Raincoats, Captain Beefheart & His Magic Band, Alice Cooper, T. Rex, Archie Shepp, Billie Holiday, Teddy Wilson, Nirvana, Mudhoney, Dinosaur Jr., Jackson C. Frank, Bush Tetras, Germs, Boredoms, Lou Reed, The Beach Boys, David Bowie, Sparks, Siouxsie and the Banshees, The Damned, The Mentally Ill, Minor Threat, Black Flag, The Untouchables, Iron Cross, The Faith, Void, Negative Approach, Youth Brigade, S.O.A., Anne Briggs, The Fugs, Jimi Hendrix",
  "artist": "Tapper Zukie, Patti Smith, Teenage Jesus & The Jerks, MARS, Public Image Ltd., The Slits, The Raincoats, Captain Beefheart & His Magic Band, Alice Cooper, T. Rex, Archie Shepp, Billie Holiday, Teddy Wilson, Nirvana, Mudhoney, Dinosaur Jr., Jackson C. Frank, Bush Tetras, Germs, Boredoms, Lou Reed, The Beach Boys, David Bowie, Sparks, Siouxsie and the Banshees, The Damned, The Mentally Ill, Minor Threat, Black Flag, The Untouchables, Iron Cross, The Faith, Void, Negative Approach, Youth Brigade, S.O.A., Anne Briggs, The Fugs, Jimi Hendrix",
  "length": "226100596"
}
