{
  "id": "all-my-favorite-songs-013-steve-albini",
  "title": "All My Favorite Songs 013 by Steve Albini - Rage Guest (part 1 of 2)",
  "timestamp": 1636544096,
  "webpage_url": "http://allmyfavoritesongs.com#013",
  "description": "Steve Albini (born July 22, 1961) is an American musician, record producer, audio engineer and music journalist. He was a member of Big Black, Rapeman and Flour, and is a member of Shellac. He is the founder, owner and principal engineer of Electrical Audio, a recording studio complex in Chicago. In 2018, Albini estimated that he had worked on several thousand albums over his career. He has worked with acts such as Nirvana, Pixies, the Breeders and PJ Harvey. Albini is also known for his outspoken views on the music industry, having stated repeatedly that it financially exploits artists and homogenizes their sound, as well as the flaws in the digital recording process and the superiority of analog technology. \n\n Albini's engineering skills have been celebrated for their sense of space, naturalistic tone, and the power of his guitar and drum sounds; his own guitar work is as imaginatively abrasive as his lyrics, which can be challenging and sometimes confrontational. Nearly alone among well-known producers and musicians, Albini refuses to take ongoing royalties from album sales, feeling that a producer's job is to record the music to the band's desires, and that paying producers as if they had contributed artistically to an album is unethical. \n\n In this episode, part one of a series of two, all songs selected by Steve Albini as guest for Australian TV show Rage, on June 29 2013. \n\n Lineup:\n The B-52's, Blondie, The Stranglers, Man Or Astro-Man, Chad Van Gaalen, Lou Reed, The Specials, The Cars, Siouxsie and the Banshees, D. Rider, Superchunk, The Breeders, Andrew Bird, Angus & Julia Stone, Björk, A1 People, Pete Shelley, Cheap Trick, Big Black, Altered Images, Pere Ubu, Sonic Youth, Bailter Space, Useless ID, Alan Vega, Bauhaus, Toys Went Berserk, Charge Group, Tortoise, Cat Power, The Only Ones, Black Box Recorder, The Human League, Tubeway Army, Kraftwerk, Xiu Xiu, Plastic Bertrand, Mucca Pazza, Radio Birdman, Ted Leo and the Pharmacists, The Bronx, Mclusky, Public Image Ltd., Sex Pistols, X-Ray Spex, Alice Cooper, Neil Young, Crazy Horse, Willie Nelson, The Birthday Party, Dead Meadow, Red Fang, Archers Of Loaf, The Amps, Dead Rider, Har Mar Superstar, Beth Ditto, CeeLo Green",
  "artist": "The B-52's, Blondie, The Stranglers, Man Or Astro-Man, Chad Van Gaalen, Lou Reed, The Specials, The Cars, Siouxsie and the Banshees, D. Rider, Superchunk, The Breeders, Andrew Bird, Angus & Julia Stone, Björk, A1 People, Pete Shelley, Cheap Trick, Big Black, Altered Images, Pere Ubu, Sonic Youth, Bailter Space, Useless ID, Alan Vega, Bauhaus, Toys Went Berserk, Charge Group, Tortoise, Cat Power, The Only Ones, Black Box Recorder, The Human League, Tubeway Army, Kraftwerk, Xiu Xiu, Plastic Bertrand, Mucca Pazza, Radio Birdman, Ted Leo and the Pharmacists, The Bronx, Mclusky, Public Image Ltd., Sex Pistols, X-Ray Spex, Alice Cooper, Neil Young, Crazy Horse, Willie Nelson, The Birthday Party, Dead Meadow, Red Fang, Archers Of Loaf, The Amps, Dead Rider, Har Mar Superstar, Beth Ditto, CeeLo Green",
  "length": "409764758"
}
