{
  "id": "all-my-favorite-songs-048-pixies",
  "title": "All My Favorite Songs 048 by The Pixies - Where is my mixtape?",
  "timestamp": 1681900496,
  "webpage_url": "https://allmyfavoritesongs.com#048",
  "description": "The Pixies are an American alternative rock band formed in 1986, in Boston, Massachusetts. Until 2013, the band consisted of Black Francis (vocals, rhythm guitar, songwriter), Joey Santiago (lead guitar), Kim Deal (bass, vocals) and David Lovering (drums). They disbanded acrimoniously in 1993 but reunited in 2004. After Deal left in 2013, the Pixies hired Kim Shattuck as a touring bassist; she was replaced that year by Paz Lenchantin, who became a permanent member in 2016.\n\nThe Pixies are associated with the 1990s alternative rock boom, and draws on elements including punk rock and surf rock. Their music is known for dynamic 'loud-quiet-loud' shifts and song structures. Francis is the Pixies' primary songwriter; his often surreal lyrics cover offbeat subjects such as extraterrestrials, incest, and biblical violence. The band achieved modest popularity in the US but was more successful in Europe. Their jarring pop sound influenced acts such as Nirvana, Radiohead, The Smashing Pumpkins and Weezer.\n\n In this episode a playlist of songs created by the Pixies and published in a popular music streaming platform (that shall remain unnamed) between December 2017 and July 2019. \n\n Lineup:\n Blue Öyster Cult, Fleetwood Mac, The Doors, Black Sabbath, Stevie Ray Vaughan, Dick Dale, Jimi Hendrix, T. Rex, Teenage Fanclub, ACDC, Baxter Dury, The Velvet Underground, The Rolling Stones, Sugar, The Cure, Eels, The Clash, The Psychedelic Furs, Alabama Shakes, Andrew Norman, Boston Modern Orchestra Project, Gil Rose, Ty Segall, Surf Friends, David Bowie, Mose Allison, Throwing Muses, Hüsker Dü, Peter, Paul and Mary, Thelonious Monk, Explosions In The Sky, The Beatles, Buzzcocks, The Fall, Weezer, Moondog, Suicide, Nico",
  "artist": "Blue Öyster Cult, Fleetwood Mac, The Doors, Black Sabbath, Stevie Ray Vaughan, Dick Dale, Jimi Hendrix, T. Rex, Teenage Fanclub, ACDC, Baxter Dury, The Velvet Underground, The Rolling Stones, Sugar, The Cure, Eels, The Clash, The Psychedelic Furs, Alabama Shakes, Andrew Norman, Boston Modern Orchestra Project, Gil Rose, Ty Segall, Surf Friends, David Bowie, Mose Allison, Throwing Muses, Hüsker Dü, Peter, Paul and Mary, Thelonious Monk, Explosions In The Sky, The Beatles, Buzzcocks, The Fall, Weezer, Moondog, Suicide, Nico",
  "length": "294840183"
}
