{
  "id": "all-my-favorite-songs-040-anthony-bourdain",
  "title": "All My Favorite Songs 040 by Anthony Bourdain - 25 Favorite Songs To Cook To",
  "timestamp": 1663065296,
  "webpage_url": "https://allmyfavoritesongs.com#040",
  "description": "Anthony Michael Bourdain (June 25, 1956 – June 8, 2018) was an American celebrity chef, author, and travel documentarian who starred in programs focusing on the exploration of international culture, cuisine, and the human condition. Bourdain was a figure who became synonymous with non-conformity and a determination to forge his own path, regardless of the hurdles in front of him. Whether through his progressive food, his dedication to the dive bar and all its inhabitants, or his adoration of all things punk, Anthony Bourdain was a bastion of anti-establishment splendour and he was determined to integrate his two passions.\n\n In this episode the list of perfect songs to cook to, created by Bourdain for his PBS show The Mind of a Chef, that aired in 6 seasons from 2012 to 2017. \n\n Lineup:\n Bobby Womack, Curtis Mayfield, Mark Lanegan, Bill Withers, Bob Dylan, Roxy Music, Bush Tetras, Johnny Thunders, The Chambers Brothers, Pretenders, The Velvet Underground, A Tribe Called Quest, Tony! Toni! Toné!, The Brian Jonestown Massacre, Stevie Ray Vaughan, Sly & The Family Stone, Ryuichi Sakamoto, The Rolling Stones, Randy Crawford, Porno for Pyros, Jacques Dutronc, Ennio Morricone, John Barry, Elvis Costello & The Attractions, Earth, Wind & Fire",
  "artist": "Bobby Womack, Curtis Mayfield, Mark Lanegan, Bill Withers, Bob Dylan, Roxy Music, Bush Tetras, Johnny Thunders, The Chambers Brothers, Pretenders, The Velvet Underground, A Tribe Called Quest, Tony! Toni! Toné!, The Brian Jonestown Massacre, Stevie Ray Vaughan, Sly & The Family Stone, Ryuichi Sakamoto, The Rolling Stones, Randy Crawford, Porno for Pyros, Jacques Dutronc, Ennio Morricone, John Barry, Elvis Costello & The Attractions, Earth, Wind & Fire",
  "length": "201007156"
}
