{
  "id": "all-my-favorite-songs-016-kurt-cobain",
  "title": "All My Favorite Songs 016 by Kurt Cobain - Top 50 Albums",
  "timestamp": 1637580896,
  "webpage_url": "http://allmyfavoritesongs.com#016",
  "description": "Kurt Donald Cobain (February 20, 1967 – c. April 5, 1994) was an American singer, songwriter, artist and musician. He was the frontman of the rock band Nirvana, serving as the band's guitarist, lead vocalist, and primary songwriter. Through his angst-fueled songwriting and anti-establishment persona, Cobain's compositions widened the thematic conventions of mainstream rock music. He was often heralded as a spokesman of Generation X and is considered to be one of the most influential musicians in the history of alternative rock. \n\n This episode is based on Kurt's handwritten list of Top 50 albums, as featured in the 2002 anthology Journals. Note we included a song from each side of The Faith/Void split LP which brings our song total to 51. \n\n Lineup:\n The Stooges, Pixies, The Breeders, The Vaselines, The Shaggs, Fang, MDC, Scratch Acid, Saccharine Trust, Butthole Surfers, Black Flag, Bad Brains, Gang Of Four, Sex Pistols, The Frogs, PJ Harvey, Sonic Youth, The Knack, The Saints, Kleenex, The Raincoats, Young Marble Giants, Aerosmith, Germs, R.E.M., Shonen Knife, The Slits, The Clash, The Faith, Void, Rites of Spring, Beat Happening, Tales Of Terror, Lead Belly, Mudhoney, Daniel Johnston, Flipper, The Beatles, Half Japanese, Fear, Public Image Ltd., Public Enemy, Marine Girls, David Bowie, Wipers, Mazzy Star, Swans",
  "artist": "The Stooges, Pixies, The Breeders, The Vaselines, The Shaggs, Fang, MDC, Scratch Acid, Saccharine Trust, Butthole Surfers, Black Flag, Bad Brains, Gang Of Four, Sex Pistols, The Frogs, PJ Harvey, Sonic Youth, The Knack, The Saints, Kleenex, The Raincoats, Young Marble Giants, Aerosmith, Germs, R.E.M., Shonen Knife, The Slits, The Clash, The Faith, Void, Rites of Spring, Beat Happening, Tales Of Terror, Lead Belly, Mudhoney, Daniel Johnston, Flipper, The Beatles, Half Japanese, Fear, Public Image Ltd., Public Enemy, Marine Girls, David Bowie, Wipers, Mazzy Star, Swans",
  "length": "251341055"
}
