{
  "id": "all-my-favorite-songs-053-marc-rebillet",
  "title": "All My Favorite Songs 053 by Marc Rebillet - Suggestions",
  "timestamp": 1689676496,
  "webpage_url": "https://allmyfavoritesongs.com#053",
  "description": "Marc Rebillet (born December 15, 1988) is an American electronic musician and YouTuber from Dallas, Texas, currently based in New York City. Rebillet is known for his improvised funk and hip-hop electronic music with free flowing, humorous lyrics. Rebillet distributes his work primarily through YouTube videos and Twitch live streams using a loop station, keyboard, vocals and percussion instruments to produce his songs in his apartment.\n\n In this episode, a playlist published by Rebillet with a popular audio streaming platform (that shall remain unnamed), between Dec 2017 and Feb 2019. \n\n Lineup:\n Sly & The Family Stone, Mary Lou Williams, Little Beaver, Ross from Friends, JIMMY EDGAR, Dirty Projectors, Björk, The Beatles, Pescado Rabioso, James Holden, Sibylle Baier, Gustav Mahler, Gabriel Garzón-Montano, TEK.LUN, Bastien Keb, Big Thief, Roberta Flack, Donny Hathaway, Mndsgn, Mose Allison, Aretha Franklin, Steve Lacy, Department Of Eagles, The Temptations, Hus Kingpin, Allen Toussaint, Serge Gainsbourg, Royce Wood Junior, Matmos, Amnesty, Bill Callahan, Viola James, Yann Kesz, James Blake, Andy Bey, Photay, J.J. Cale, Tom Waits, Curren$y, Bonnie Raitt, Emily King, Bobby Wright, Agar Agar, Prince",
  "artist": "Sly & The Family Stone, Mary Lou Williams, Little Beaver, Ross from Friends, JIMMY EDGAR, Dirty Projectors, Björk, The Beatles, Pescado Rabioso, James Holden, Sibylle Baier, Gustav Mahler, Gabriel Garzón-Montano, TEK.LUN, Bastien Keb, Big Thief, Roberta Flack, Donny Hathaway, Mndsgn, Mose Allison, Aretha Franklin, Steve Lacy, Department Of Eagles, The Temptations, Hus Kingpin, Allen Toussaint, Serge Gainsbourg, Royce Wood Junior, Matmos, Amnesty, Bill Callahan, Viola James, Yann Kesz, James Blake, Andy Bey, Photay, J.J. Cale, Tom Waits, Curren$y, Bonnie Raitt, Emily King, Bobby Wright, Agar Agar, Prince",
  "length": "304317260"
}
