{
  "id": "all-my-favorite-songs-051-cypress-hill",
  "title": "All My Favorite Songs 051 by Cypress Hill - Smoking Joints Stoner Favorites",
  "timestamp": 1686652496,
  "webpage_url": "https://allmyfavoritesongs.com#051",
  "description": "Cypress Hill is an American hip hop group from South Gate, California. They have sold over 20 million albums worldwide, and they have obtained multi-platinum and platinum certifications. The group has been critically acclaimed for their first five albums. They are considered to be among the main progenitors of West Coast and 1990s hip hop. All of the group members advocate for medical and recreational use of cannabis in the United States. In 2019, Cypress Hill became the first hip hop group to have a star on the Hollywood Walk of Fame.\n\n In this episode, all songs selected by Eric Bobo and Sen Dog and published as two separate playlists with a popular audio streaming provider (that shall remain unnamed), between April 19 2016 and August 30 2017. \n\n Lineup:\n T-mo Goodie, Warren G, Collie Buddz, Crown Royale, Eric Burdon, War, T.I., Control Machete, Cypress Hill, Sango, McClenney, Pete Rock & C.L. Smooth, Parliament, Onyx, Steel Pulse, Outkast, Naughty By Nature, Zapp, Kendrick Lamar, Talking Heads, Beastie Boys, House Of Pain, Kool & The Gang, A Tribe Called Quest, Sonic Youth, Sister Nancy, Rick James, Sublime, Cheech And Chong with Alice Bowie, Alice Bowie, Damian Marley, Led Zeppelin, Snoop Dogg, Daz Dillinger, KISS, Stone Temple Pilots, Slipknot, EPMD, Nirvana, Johnny Cash, Guns N' Roses",
  "artist": "T-mo Goodie, Warren G, Collie Buddz, Crown Royale, Eric Burdon, War, T.I., Control Machete, Cypress Hill, Sango, McClenney, Pete Rock & C.L. Smooth, Parliament, Onyx, Steel Pulse, Outkast, Naughty By Nature, Zapp, Kendrick Lamar, Talking Heads, Beastie Boys, House Of Pain, Kool & The Gang, A Tribe Called Quest, Sonic Youth, Sister Nancy, Rick James, Sublime, Cheech And Chong with Alice Bowie, Alice Bowie, Damian Marley, Led Zeppelin, Snoop Dogg, Daz Dillinger, KISS, Stone Temple Pilots, Slipknot, EPMD, Nirvana, Johnny Cash, Guns N' Roses",
  "length": "276250021"
}
