{
  "id": "all-my-favorite-songs-007-sebastian",
  "title": "All My Favorite Songs 007 by SebastiAn - Picks",
  "timestamp": 1635417296,
  "webpage_url": "http://allmyfavoritesongs.com#007",
  "description": "Sébastien Akchoté-Bozović (born 3 February 1981), known mononymously as Sebastian (stylised as SebastiAn), is a French musician, composer, producer, mixer, engineer, vocalist and DJ affiliated with Ed Banger Records. He has worked as a solo electronic musician and as a remixer for bands and singers such as Charlotte Gainsbourg, Daft Punk, Beastie Boys, Bloc Party, and Nero. He has also composed and produced songs for Charlotte Gainsbourg, Katerine, Kavinsky, Frank Ocean, Uffie and Woodkid, and he has composed soundtracks for the films Our Day Will Come, The World Is Yours and Steak (in which he also acted, credited under the name Sebastian Akchoté). Many of his tracks have been used on television and in video games. \n\n Lineup:\n SebastiAn, Syd, Gary Numan, Bakar, Iggy Pop, Bon Iver, Gallant, Jhené Aiko, A. K. Paul, Mica Levi, Jackson And His Computer Band, TOBACCO, Beck, Frank Ocean, The Waitresses, JPEGMAFIA, Mr. Oizo, Phra, Daft Punk, Sparks, Kavinsky, Lightning Bolt, Chassol, Prince, Mother's Finest, The Beach Boys, Chet Baker, The Marketts, Mark Bell, Errorsmith, Orchestre Lamoureux, DJ Mehdi, Thomas Roussel, Aphex Twin, Billie Holiday, Catherine Deneuve, Kanye West, PARTYNEXTDOOR, Googoosh, Charlotte Gainsbourg, Ennio Morricone, Hrvoje Hitrec, Wings",
  "artist": "SebastiAn, Syd, Gary Numan, Bakar, Iggy Pop, Bon Iver, Gallant, Jhené Aiko, A. K. Paul, Mica Levi, Jackson And His Computer Band, TOBACCO, Beck, Frank Ocean, The Waitresses, JPEGMAFIA, Mr. Oizo, Phra, Daft Punk, Sparks, Kavinsky, Lightning Bolt, Chassol, Prince, Mother's Finest, The Beach Boys, Chet Baker, The Marketts, Mark Bell, Errorsmith, Orchestre Lamoureux, DJ Mehdi, Thomas Roussel, Aphex Twin, Billie Holiday, Catherine Deneuve, Kanye West, PARTYNEXTDOOR, Googoosh, Charlotte Gainsbourg, Ennio Morricone, Hrvoje Hitrec, Wings",
  "length": "277264443"
}
