{
  "id": "all-my-favorite-songs-018-pj-harvey",
  "title": "All My Favorite Songs 018 by PJ Harvey - 11 12 13 14",
  "timestamp": 1638358496,
  "webpage_url": "https://allmyfavoritesongs.com#018",
  "description": "Polly Jean Harvey (born 9 October 1969) is an English singer, songwriter and musician. Primarily known as a vocalist and guitarist, she is also proficient with a wide range of instruments. Over the course of her career, Harvey established herself as one of the most individual and influential songwriters of her era, exploring themes of sex, religion, and political issues with unnerving honesty, dark humor, and a twisted theatricality. \n\n This episode is a compilation of the four playlists published by Harvey between August 2019 and August 2021. \n\n Lineup:\n Claude Debussy, Martin Jones, Colin Stetson, Amen Dunes, Empire of the Sun, Ólafur Arnalds, Nils Frahm, Captain Beefheart & His Magic Band, Connan Mockasin, Thom Yorke, Coby Sey, Bendik Giske, Tirzah, Sarah Neufeld, Big Thief, Hekla, Sibylle Baier, Nick Cave & The Bad Seeds, Desert Sessions, Liela Moss, slowthai, Mura Masa, Eartheater, Hole, Radiohead, Nicholas Britell, Hanan Townshend, Here We Go Magic, Mark Lanegan, Bob Dylan, Anne Briggs, Stina Nordenstam, Jed Kurzel, SAULT, Michael Kiwanuka, Martin Phipps, Johnny Flynn, Robert Macfarlane, Low, Sleaford Mods, Superstate, Graham Coxon, Valentina Pappalardo, Shabazz Palaces",
  "artist": "Claude Debussy, Martin Jones, Colin Stetson, Amen Dunes, Empire of the Sun, Ólafur Arnalds, Nils Frahm, Captain Beefheart & His Magic Band, Connan Mockasin, Thom Yorke, Coby Sey, Bendik Giske, Tirzah, Sarah Neufeld, Big Thief, Hekla, Sibylle Baier, Nick Cave & The Bad Seeds, Desert Sessions, Liela Moss, slowthai, Mura Masa, Eartheater, Hole, Radiohead, Nicholas Britell, Hanan Townshend, Here We Go Magic, Mark Lanegan, Bob Dylan, Anne Briggs, Stina Nordenstam, Jed Kurzel, SAULT, Michael Kiwanuka, Martin Phipps, Johnny Flynn, Robert Macfarlane, Low, Sleaford Mods, Superstate, Graham Coxon, Valentina Pappalardo, Shabazz Palaces",
  "length": "283340555"
}
