{
  "id": "all-my-favorite-songs-036-frank-zappa",
  "title": "All My Favorite Songs 036 by Frank Zappa - Fraudulent DJ (part 2 of 2)",
  "timestamp": 1656153296,
  "webpage_url": "https://allmyfavoritesongs.com#036",
  "description": "Frank Vincent Zappa (December 21, 1940 – December 4, 1993) was an American musician, singer, composer, songwriter and bandleader. His work is characterized by nonconformity, free-form improvisation, sound experiments, musical virtuosity and satire of American culture. In a career spanning more than 30 years, Zappa composed rock, pop, jazz, jazz fusion, orchestral and musique concrète works, and produced almost all of the 60-plus albums that he released with his band the Mothers of Invention and as a solo artist. Zappa also directed feature-length films and music videos, and designed album covers. He is considered one of the most innovative and stylistically diverse musicians of his generation.\n\n On a number of occasions Zappa appeared in radio show slots, airing and generally discussing his favored music, or occasionally guesting on a 'club turntable', describing himself as a 'Fraudulent DJ'. In this episode, part two of a series of two, all the tracks in chronological order as selected by Zappa (with exception of most of his own tracks) for all his DJ appearances that have been documented, and that took place between 1968 and 1984. \n\n Lineup:\n Frank Zappa, Jimi Hendrix, Alice Cooper, Led Zeppelin, The Clovers, The Lamplighters, The Mothers Of Invention, Captain Beefheart & His Magic Band, Igor Stravinsky, Columbia Symphony Orchestra, John Lee Hooker, The Rolling Stones, The Young Rascals, Howlin' Wolf, The Velours, The Channels, Earl Lewis, Joni Mitchell, Muddy Waters, Jimmy Reed, Blondie, The Specials, Gerry & The Holograms, Nina Hagen, The Jets, Konrad Koselleck Big Band, Ellen Ten Damme, U.K. Subs, Snuky Tate, Robert & Johnny, The Flying Lizards, Joe Jackson, Gary Numan, The Police, Destroy All Monsters, The Saints, L Shankar, The Tubes, Suburban Lawns, Captain Beefheart, John Cooper Clarke, Public Image Ltd., The Firemen, The Deadliners, Plastics, Jeff Simmons, New Musik, Edgard Varèse, Polish National Radio Symphony Orchestra, Christopher Lyndon-Gee, ZZ Top, The Velvet Underground, Nico, Black Sabbath, Lene Lovich, The GTOs, Queen, Lynyrd Skynyrd, The Top Charts D.J., The Beatles, SpizzEnergi, Traffic, Wild Man Fischer, Lew Lewis, Tomorrow, Frankie Valli, Blue Öyster Cult, Foreigner, ACDC, Sue Saad & the Next, Van Halen, Buzzcocks, The Jam, Pink Floyd, Journey",
  "artist": "Frank Zappa, Jimi Hendrix, Alice Cooper, Led Zeppelin, The Clovers, The Lamplighters, The Mothers Of Invention, Captain Beefheart & His Magic Band, Igor Stravinsky, Columbia Symphony Orchestra, John Lee Hooker, The Rolling Stones, The Young Rascals, Howlin' Wolf, The Velours, The Channels, Earl Lewis, Joni Mitchell, Muddy Waters, Jimmy Reed, Blondie, The Specials, Gerry & The Holograms, Nina Hagen, The Jets, Konrad Koselleck Big Band, Ellen Ten Damme, U.K. Subs, Snuky Tate, Robert & Johnny, The Flying Lizards, Joe Jackson, Gary Numan, The Police, Destroy All Monsters, The Saints, L Shankar, The Tubes, Suburban Lawns, Captain Beefheart, John Cooper Clarke, Public Image Ltd., The Firemen, The Deadliners, Plastics, Jeff Simmons, New Musik, Edgard Varèse, Polish National Radio Symphony Orchestra, Christopher Lyndon-Gee, ZZ Top, The Velvet Underground, Nico, Black Sabbath, Lene Lovich, The GTOs, Queen, Lynyrd Skynyrd, The Top Charts D.J., The Beatles, SpizzEnergi, Traffic, Wild Man Fischer, Lew Lewis, Tomorrow, Frankie Valli, Blue Öyster Cult, Foreigner, ACDC, Sue Saad & the Next, Van Halen, Buzzcocks, The Jam, Pink Floyd, Journey",
  "length": "504840537"
}
