{
  "id": "all-my-favorite-songs-014-steve-albini",
  "title": "All My Favorite Songs 014 by Steve Albini - Rage Guest (part 2 of 2)",
  "timestamp": 1636889696,
  "webpage_url": "http://allmyfavoritesongs.com#014",
  "description": "Steve Albini (born July 22, 1961) is an American musician, record producer, audio engineer and music journalist. He was a member of Big Black, Rapeman and Flour, and is a member of Shellac. He is the founder, owner and principal engineer of Electrical Audio, a recording studio complex in Chicago. In 2018, Albini estimated that he had worked on several thousand albums over his career. He has worked with acts such as Nirvana, Pixies, the Breeders and PJ Harvey. Albini is also known for his outspoken views on the music industry, having stated repeatedly that it financially exploits artists and homogenizes their sound, as well as the flaws in the digital recording process and the superiority of analog technology. \n\n Albini's engineering skills have been celebrated for their sense of space, naturalistic tone, and the power of his guitar and drum sounds; his own guitar work is as imaginatively abrasive as his lyrics, which can be challenging and sometimes confrontational. Nearly alone among well-known producers and musicians, Albini refuses to take ongoing royalties from album sales, feeling that a producer's job is to record the music to the band's desires, and that paying producers as if they had contributed artistically to an album is unethical. \n\n In this episode, part one of a series of two, all songs selected by Steve Albini as guest for Australian TV show Rage, on June 29 2013. \n\n Lineup:\n Bill Withers, Stevie Wonder, Repercussions, Curtis Mayfield, Philip Glass, Broadcast, Chrome, Sisters of Mercy, Venom P. Stinger, Killing Joke, Meshuggah, U.S. Maple, Smog, Mariachi El Bronx, Pikelet, The Angels, ACDC, ZZ Top, Buckcherry, Pretenders, The Kinks, Sweet, Turbonegro, Lubricated Goat, Budd, Brujeria, Sepultura, Bad Brains, The Residents, Sparklehorse, Swans, Dead Moon, Minutemen, R.L. Burnside, Randy Newman, Low, A Certain Ratio, Bo Diddley, Canned Heat, Palace Music, Screaming Trees, Slade, The Who, Buzzcocks, Spiritualized, Purplene, Scout Niblett, Cheer Accident, Big Black, The Specials, Leonard Cohen, Kraftwerk, The Saints, The Stranglers, Wire, High Dependency Unit, Boards of Canada, The White Stripes, Stiff Little Fingers, Motörhead, Ramones, Brian Eno, John Cale, Queen",
  "artist": "Bill Withers, Stevie Wonder, Repercussions, Curtis Mayfield, Philip Glass, Broadcast, Chrome, Sisters of Mercy, Venom P. Stinger, Killing Joke, Meshuggah, U.S. Maple, Smog, Mariachi El Bronx, Pikelet, The Angels, ACDC, ZZ Top, Buckcherry, Pretenders, The Kinks, Sweet, Turbonegro, Lubricated Goat, Budd, Brujeria, Sepultura, Bad Brains, The Residents, Sparklehorse, Swans, Dead Moon, Minutemen, R.L. Burnside, Randy Newman, Low, A Certain Ratio, Bo Diddley, Canned Heat, Palace Music, Screaming Trees, Slade, The Who, Buzzcocks, Spiritualized, Purplene, Scout Niblett, Cheer Accident, Big Black, The Specials, Leonard Cohen, Kraftwerk, The Saints, The Stranglers, Wire, High Dependency Unit, Boards of Canada, The White Stripes, Stiff Little Fingers, Motörhead, Ramones, Brian Eno, John Cale, Queen",
  "length": "464038981"
}
