{
  "id": "all-my-favorite-songs-009-slipknot",
  "title": "All My Favorite Songs 009 by Spliknot - Halloween Playlist",
  "timestamp": 1635680096,
  "webpage_url": "http://allmyfavoritesongs.com#009",
  "description": "Slipknot is an American heavy metal band formed in Des Moines, Iowa, in 1995 by percussionist Shawn Crahan, drummer Joey Jordison and bassist Paul Gray. After several lineup changes in its early years, the band settled on nine members for more than a decade: Crahan, Jordison, Gray, Craig Jones, Mick Thomson, Corey Taylor, Sid Wilson, Chris Fehn, and Jim Root. Gray died on May 24, 2010, and was replaced during 2011–2014 by guitarist Donnie Steele. Slipknot's mix of grinding, post-Korn alternative metal, Marilyn Manson-esque neo-shock rock, and rap-metal helped make them one of the most popular bands in the nu-metal explosion of the late 1990s and early 2000s. But even more helpful was their theatrical, attention-grabbing image: the band always performed in identical industrial jump suits and homemade Halloween masks, and added to their mysterious anonymity by adopting the numbers zero through eight as stage aliases. Add to that a lyrical preoccupation with darkness and nihilism, and an affectionately insulting name for their fans ('Maggots'), and Slipknot's blueprint for nu-metal success was set. \n\n Lineup:\n Slipknot, Talking Heads, S.O.D. Stormtroopers of Death, Dangerous Toys, Iron Maiden, Ho99o9, Refused, Public Enemy, Marilyn Manson, White Zombie, Slayer, Venom, Megadeth, Ice Cube, Dr. Dre, Misfits, Glenn Danzig, Black Sabbath, Judas Priest, Testament, Alice Cooper, Behemoth, Neurosis, Mötley Crüe, Concrete Blonde, W.A.S.P., Slipknot",
  "artist": "Slipknot, Talking Heads, S.O.D. Stormtroopers of Death, Dangerous Toys, Iron Maiden, Ho99o9, Refused, Public Enemy, Marilyn Manson, White Zombie, Slayer, Venom, Megadeth, Ice Cube, Dr. Dre, Misfits, Glenn Danzig, Black Sabbath, Judas Priest, Testament, Alice Cooper, Behemoth, Neurosis, Mötley Crüe, Concrete Blonde, W.A.S.P., Slipknot",
  "length": "221575526"
}
