{
  "id": "all-my-favorite-songs-035-frank-zappa",
  "title": "All My Favorite Songs 035 by Frank Zappa - Fraudulent DJ (part 1 of 2)",
  "timestamp": 1655375696,
  "webpage_url": "https://allmyfavoritesongs.com#035",
  "description": "Frank Vincent Zappa (December 21, 1940 – December 4, 1993) was an American musician, singer, composer, songwriter and bandleader. His work is characterized by nonconformity, free-form improvisation, sound experiments, musical virtuosity and satire of American culture. In a career spanning more than 30 years, Zappa composed rock, pop, jazz, jazz fusion, orchestral and musique concrète works, and produced almost all of the 60-plus albums that he released with his band the Mothers of Invention and as a solo artist. Zappa also directed feature-length films and music videos, and designed album covers. He is considered one of the most innovative and stylistically diverse musicians of his generation.\n\n On a number of occasions Zappa appeared in radio show slots, airing and generally discussing his favored music, or occasionally guesting on a 'club turntable', describing himself as a 'Fraudulent DJ'. In this episode, part one of a series of two, all the tracks in chronological order as selected by Zappa (with exception of most of his own tracks) for all his DJ appearances that have been documented, and that took place between 1968 and 1984. \n\n Lineup:\n Frank Zappa, The Mothers Of Invention, Ewan MacColl, The Hollywood Persuaders, Pierre Boulez, Hilary Summers, Ensemble Intercontemporain, The Dreamlovers, The Penguins, Charles Mingus, Frankie Lee Sims, Vernon Green & The Medallions, Richard Berry & The Dreamers, The Paragons, Big Moose, The Turbans, Johnny Guitar Watson, The Spaniels, J.B. Lenoir, Vernon Green, The Medallions, Bill Haley & His Comets, The Chips, The Velvets, Richard Berry & The Pharaohs, Johnny 'Guitar' Watson, The Feathers, Don & Dewey, The Jewels, The Cufflinks, Johnny Ace, Wilbur Whitfield & The Pleasers, Hank Ballard & The Midnighters, Jackie & The Starlites, The Cellos, The Rolling Crew, Screamin' Jay Hawkins, Paul Robeson, Huey 'Piano' Smith, Clarence 'Gatemouth' Brown, The Six Teens, The Laurie Sisters, Lloyd Terrell, Ruben And The Jets, The Hawks, The Olympics, Andre Williams, The Gaylarks, Little Sunny Day and the Clouds, The Clovers, The Harptones, Baby Ray And The Ferns, Muddy Waters, The Shaggs, Richard Berry, The Robins, Bob Landers, Willie Joe, Tony Allen, Peppermint Harris, The El Dorados, The 5 Campbells, Elmore James, The Moonlighters, Don Julian, The Larks, Lloyd Price, The Solitaires, Black Oak Arkansas, Edgard Varèse, Frederic Waldman, NY Wind Ensemble, Olivier Messiaen, BBC Symphony OrchestraAntal Dorati, Antal Doráti, BBC Symphony Orchestra, Anton Webern, Nürnberg Symphony Orchestra, Othmar Maga",
  "artist": "Frank Zappa, The Mothers Of Invention, Ewan MacColl, The Hollywood Persuaders, Pierre Boulez, Hilary Summers, Ensemble Intercontemporain, The Dreamlovers, The Penguins, Charles Mingus, Frankie Lee Sims, Vernon Green & The Medallions, Richard Berry & The Dreamers, The Paragons, Big Moose, The Turbans, Johnny Guitar Watson, The Spaniels, J.B. Lenoir, Vernon Green, The Medallions, Bill Haley & His Comets, The Chips, The Velvets, Richard Berry & The Pharaohs, Johnny 'Guitar' Watson, The Feathers, Don & Dewey, The Jewels, The Cufflinks, Johnny Ace, Wilbur Whitfield & The Pleasers, Hank Ballard & The Midnighters, Jackie & The Starlites, The Cellos, The Rolling Crew, Screamin' Jay Hawkins, Paul Robeson, Huey 'Piano' Smith, Clarence 'Gatemouth' Brown, The Six Teens, The Laurie Sisters, Lloyd Terrell, Ruben And The Jets, The Hawks, The Olympics, Andre Williams, The Gaylarks, Little Sunny Day and the Clouds, The Clovers, The Harptones, Baby Ray And The Ferns, Muddy Waters, The Shaggs, Richard Berry, The Robins, Bob Landers, Willie Joe, Tony Allen, Peppermint Harris, The El Dorados, The 5 Campbells, Elmore James, The Moonlighters, Don Julian, The Larks, Lloyd Price, The Solitaires, Black Oak Arkansas, Edgard Varèse, Frederic Waldman, NY Wind Ensemble, Olivier Messiaen, BBC Symphony OrchestraAntal Dorati, Antal Doráti, BBC Symphony Orchestra, Anton Webern, Nürnberg Symphony Orchestra, Othmar Maga",
  "length": "365289324"
}
