{
  "id": "all-my-favorite-songs-038-lou-reed",
  "title": "All My Favorite Songs 038 by Lou Reed - 100 Favorite Songs Of All Time",
  "timestamp": 1657794896,
  "webpage_url": "https://allmyfavoritesongs.com#038",
  "description": "Lewis Allan Reed (March 2, 1942 - October 27, 2013) was an American musician, singer, songwriter, and poet. He was the guitarist, singer, and principal songwriter for the rock band the Velvet Underground and had a solo career that spanned five decades. Although not commercially successful during its existence, the Velvet Underground became regarded as one of the most influential bands in the history of underground and alternative rock music. Reed's distinctive deadpan voice, poetic and transgressive lyrics, and experimental guitar playing were trademarks throughout his long career.\n\n In this episode 100 of the songs Reed considered the greatest of all time, as shared with the Helsinki Music Club in 2004. \n\n Lineup:\n Ornette Coleman, Eddie & Ernie, Rahsaan Roland Kirk, Ray Charles, Little Richard, The Excellents, Lorraine Ellison, Elvis Presley, Carl Perkins, Chuck Berry, Billy Lee Riley, Wanda Jackson, Nolan Strong & The Diablos, Roy Orbison, Musical Creations Studio Musicians (Karaoke), Fats Domino, Dion & The Belmonts, Hank Williams, Bo Diddley, Chris Connor, Chet Baker, Jimmy Scott, The Mellows, Otis Redding, Jimi Hendrix, Ike & Tina Turner, Sam Cooke, Jerry Lee Lewis, J.J. Cale, Ry Cooder, (question mark) & The Mysterians, Ameritz Top Tracks, Huey 'Piano' Smith, His Clowns, Bobby Charles, Clarence 'Frogman' Henry, Jimmy Reed, John Lee Hooker, Albert King, Booker T. & the M.G.'s, Wilson Pickett, Sam & Dave, The Youngbloods, The Left Banke, The Students, Jackie & The Starlites, The Easybeats, The Cadillacs, Hank Ballard & The Midnighters, B.B. King, Al Green, Ricky Nelson, James Brown & The Famous Flames, Laurie Anderson, Kate Bush, The Beach Boys, Link Wray, Ann Peebles, Skeeter Davis, Bob Dylan, Peter Gabriel, Carpenters, Charlie Dore, The Rolling Stones, Bobby 'Blue' Bland, Solomon Burke, Sly & The Family Stone, Etta James, Carla Thomas, Clarence Carter, Aretha Franklin, Ameritz Karaoke Entertainment, James & Bobby Purify, Aaron Neville, Lee Dorsey, Detroit, U2, John Lennon, Moe Tucker, Stevie Wonder, Marvin Gaye, The Chiffons",
  "artist": "Ornette Coleman, Eddie & Ernie, Rahsaan Roland Kirk, Ray Charles, Little Richard, The Excellents, Lorraine Ellison, Elvis Presley, Carl Perkins, Chuck Berry, Billy Lee Riley, Wanda Jackson, Nolan Strong & The Diablos, Roy Orbison, Musical Creations Studio Musicians (Karaoke), Fats Domino, Dion & The Belmonts, Hank Williams, Bo Diddley, Chris Connor, Chet Baker, Jimmy Scott, The Mellows, Otis Redding, Jimi Hendrix, Ike & Tina Turner, Sam Cooke, Jerry Lee Lewis, J.J. Cale, Ry Cooder, (question mark) & The Mysterians, Ameritz Top Tracks, Huey 'Piano' Smith, His Clowns, Bobby Charles, Clarence 'Frogman' Henry, Jimmy Reed, John Lee Hooker, Albert King, Booker T. & the M.G.'s, Wilson Pickett, Sam & Dave, The Youngbloods, The Left Banke, The Students, Jackie & The Starlites, The Easybeats, The Cadillacs, Hank Ballard & The Midnighters, B.B. King, Al Green, Ricky Nelson, James Brown & The Famous Flames, Laurie Anderson, Kate Bush, The Beach Boys, Link Wray, Ann Peebles, Skeeter Davis, Bob Dylan, Peter Gabriel, Carpenters, Charlie Dore, The Rolling Stones, Bobby 'Blue' Bland, Solomon Burke, Sly & The Family Stone, Etta James, Carla Thomas, Clarence Carter, Aretha Franklin, Ameritz Karaoke Entertainment, James & Bobby Purify, Aaron Neville, Lee Dorsey, Detroit, U2, John Lennon, Moe Tucker, Stevie Wonder, Marvin Gaye, The Chiffons",
  "length": "475894732"
}
