{
  "id": "all-my-favorite-songs-032-quentin-tarantino",
  "title": "All My Favorite Songs 032 by Quentin Tarantino - Film &amp; TV Favorites",
  "timestamp": 1652524496,
  "webpage_url": "https://allmyfavoritesongs.com#032",
  "description": "Quentin Jerome Tarantino (born March 27, 1963) is an American filmmaker, actor, film critic and author. His films are characterized by frequent references to popular culture and film history, nonlinear storylines, dark humor, stylized violence, extended dialogue, pervasive use of profanity, cameos and ensemble casts. Tarantino is also known for his choice of music in his films, including soundtracks that often use songs from the 1960s and 70s. \n\n This episode features 70 tracks curated by Tarantino and that he has used within his work. It was originally published as a playlist with a popular audio streaming provider (that shall remain unnamed) in July 2019. \n\n Lineup:\n Nancy Sinatra, Harry Nilsson, Isaac Hayes, Luis Bacalov, Rocky Roberts, Edda Dell'Orso, Dusty Springfield, Jennifer Jason Leigh, Kurt Russell, Samuel L. Jackson, Chuck Berry, Bernard Herrmann, Randy Crawford, The Tornadoes, Santa Esmeralda, T. Rex, Al Hirt, Charlie Feathers, Chris Isaak, The Statler Brothers, David Hess, The Delfonics, The Mavericks, Peggy Simms, George Baker Selection, Joe Tex, Soundgarden, Jerome Patrick Hoban, Johnny Cash, Ennio Morricone, Dave Dee, Dozy, Beaky, Mick & Tich, The Lively Ones, Buddy Guy, HOTEI, ZZ Top, Dick Dale, Al Green, The Brothers Johnson, Meiko Kaji, Kim Circle, Malcolm McLaren, Roy Orbison, Alex Orbison, Chuck Turner, Elisa Toffoli, Ricky Nelson, Shivaree, The Soundtrack Singers, Ann O'Day, David Bowie, Smith, The Robins, Jim Croce, The Marketts, The White Stripes, Bill Withers, The Blasters, James Russo, The 5.6.7.8's, James Brown, 2Pac, Stealers Wheel, Lole Y Manuel, Bloodstone, Brother Dege, Nymphomania, Bobby Womack, Léo Delibes, Kool & The Gang, Robert Palmer, Pacific Gas & Electric",
  "artist": "Nancy Sinatra, Harry Nilsson, Isaac Hayes, Luis Bacalov, Rocky Roberts, Edda Dell'Orso, Dusty Springfield, Jennifer Jason Leigh, Kurt Russell, Samuel L. Jackson, Chuck Berry, Bernard Herrmann, Randy Crawford, The Tornadoes, Santa Esmeralda, T. Rex, Al Hirt, Charlie Feathers, Chris Isaak, The Statler Brothers, David Hess, The Delfonics, The Mavericks, Peggy Simms, George Baker Selection, Joe Tex, Soundgarden, Jerome Patrick Hoban, Johnny Cash, Ennio Morricone, Dave Dee, Dozy, Beaky, Mick & Tich, The Lively Ones, Buddy Guy, HOTEI, ZZ Top, Dick Dale, Al Green, The Brothers Johnson, Meiko Kaji, Kim Circle, Malcolm McLaren, Roy Orbison, Alex Orbison, Chuck Turner, Elisa Toffoli, Ricky Nelson, Shivaree, The Soundtrack Singers, Ann O'Day, David Bowie, Smith, The Robins, Jim Croce, The Marketts, The White Stripes, Bill Withers, The Blasters, James Russo, The 5.6.7.8's, James Brown, 2Pac, Stealers Wheel, Lole Y Manuel, Bloodstone, Brother Dege, Nymphomania, Bobby Womack, Léo Delibes, Kool & The Gang, Robert Palmer, Pacific Gas & Electric",
  "length": "375875405"
}
