{
  "id": "all-my-favorite-songs-023-the-hives",
  "title": "All My Favorite Songs 023 by The Hives - New Year's Eve",
  "timestamp": 1640950496,
  "webpage_url": "https://allmyfavoritesongs.com#023",
  "description": "The Hives are a Swedish rock band that rose to prominence in the early 2000s during the Garage Rock Revival. Eight years into their career, the Hives rose from garage rock stalwarts to one of the trendiest bands of the early 2000s, along with the Strokes and the White Stripes. Mixing arty contrivances such as a strict black-and-white dress code and the guidance of a (possibly imaginary) Svengali named Randy Fitzsimmons with Stooges-inspired rock, the Hives - Nicholaus Arson, Chris Dangerous, Dr. Matt Destruction, Vigilante Carlstroem, and Howlin' Pelle Almqvist - formed in 1993 in Fagersta, Sweden, while they were still in their teens. \n\n In this episode the playlist published by the band for New Year's Eve 2020-21. \n\n Lineup:\n ABBA, Viagra Boys, Amy Taylor, Los Saicos, The Cramps, ShitKid, Jacqueline Taieb, Hunx & His Punx, First Aid Kit, Tom Waits, Shannon & The Clams, Radioactivity, Turbonegro, The Hives, Oblivians, New Bomb Turks, The Sonics, Thee Headcoatees, Reigning Sound, Richard Hell, Sonic's Rendezvous Band, The Hellacopters, Dead Kennedys, Ramones, Electric Eels, Bo Diddley, Mohammed Wardi, King Gizzard & The Lizard Wizard, Charlie Megira, Julian Casablancas, Franska Trion, Tonbruket, The Wailers, Clinic, Mattiel, The Mysterians, The Stooges",
  "artist": "ABBA, Viagra Boys, Amy Taylor, Los Saicos, The Cramps, ShitKid, Jacqueline Taieb, Hunx & His Punx, First Aid Kit, Tom Waits, Shannon & The Clams, Radioactivity, Turbonegro, The Hives, Oblivians, New Bomb Turks, The Sonics, Thee Headcoatees, Reigning Sound, Richard Hell, Sonic's Rendezvous Band, The Hellacopters, Dead Kennedys, Ramones, Electric Eels, Bo Diddley, Mohammed Wardi, King Gizzard & The Lizard Wizard, Charlie Megira, Julian Casablancas, Franska Trion, Tonbruket, The Wailers, Clinic, Mattiel, The Mysterians, The Stooges",
  "length": "265078454"
}
