{
  "id": "all-my-favorite-songs-052-ditz",
  "title": "All My Favorite Songs 052 by DITZ - Coronoviriffs 2k20",
  "timestamp": 1689417296,
  "webpage_url": "https://allmyfavoritesongs.com#052",
  "description": "DITZ is an English noise rock/post-punk band that formed in Brighton in 2016. The band is most well known for an erratic live show influenced by the hardcore punk and noise rock of the 80s and 90s, which sets them apart from their peers in the UK post-punk scene. DITZ consists of Cal Francis (vocals), Anton Mocock (Guitar), Sam Evans (Drums), Jack Looker (Guitar) and Caleb Remnant (bass).\n\n In this episode, a compilation of the five playlists created by each member of the band during the COVID lockdown, and published with a popular audio streaming provider (that shall remain unnamed), in May 2020. \n\n Lineup:\n Polevaulter, Home Counties, Our Family Dog, Self Defense Family, Modest Mouse, Orville Peck, Johnny Cash, The Wants, Fugazi, Famous, Drive Like Jehu, Thank, Comadre, Red House Painters, Dionne Warwick, Blood, Interpol, DIIV, Porridge Radio, Lime Garden, Silverbacks, Black Kids, Julia Jacklin, Amelia Caesar, Bicep, Grimes, BABii, Tzusing, clipping., The Rita, Elcamino, Benny The Butcher, Kills Birds, LIFE, Death Grips, Metz, Fontaines D.C., The Jesus Lizard, IDLES, Autolux, CLT DRP, ScHoolboy Q, Freddie Gibbs, Madlib, LICE, Heavy Lungs, Gilla Band, Danny Brown, Kendrick Lamar, Ab-Soul, Earl Sweatshirt, Pure Adult, Nina Hagen, Egyptian Blue, HMLTD, Velvet Revolver, Kesha, Sick Joy, Pom Poko, PROJECTOR, Chris Isaak, Polvo, At the Drive-In, Q And Not U, Crack Cloud, Test Icicles, Faraquet, Thundercat, LCD Soundsystem, Die! Die! Die!, Lightning Bolt, Refused, The Blood Brothers, Daughters, Black Eyes, Tyler, The Creator, toe",
  "artist": "Polevaulter, Home Counties, Our Family Dog, Self Defense Family, Modest Mouse, Orville Peck, Johnny Cash, The Wants, Fugazi, Famous, Drive Like Jehu, Thank, Comadre, Red House Painters, Dionne Warwick, Blood, Interpol, DIIV, Porridge Radio, Lime Garden, Silverbacks, Black Kids, Julia Jacklin, Amelia Caesar, Bicep, Grimes, BABii, Tzusing, clipping., The Rita, Elcamino, Benny The Butcher, Kills Birds, LIFE, Death Grips, Metz, Fontaines D.C., The Jesus Lizard, IDLES, Autolux, CLT DRP, ScHoolboy Q, Freddie Gibbs, Madlib, LICE, Heavy Lungs, Gilla Band, Danny Brown, Kendrick Lamar, Ab-Soul, Earl Sweatshirt, Pure Adult, Nina Hagen, Egyptian Blue, HMLTD, Velvet Revolver, Kesha, Sick Joy, Pom Poko, PROJECTOR, Chris Isaak, Polvo, At the Drive-In, Q And Not U, Crack Cloud, Test Icicles, Faraquet, Thundercat, LCD Soundsystem, Die! Die! Die!, Lightning Bolt, Refused, The Blood Brothers, Daughters, Black Eyes, Tyler, The Creator, toe",
  "length": "438186324"
}
