{
  "id": "all-my-favorite-songs-004-viagra-boys",
  "title": "All My Favorite Songs 004 by Viagra Boys - Shrimptech Enterprises Vol.1",
  "timestamp": 1634898896,
  "webpage_url": "http://allmyfavoritesongs.com/episode/004",
  "description": "Viagra Boys are a Swedish post-punk band from Stockholm. The band was formed in 2015, with several members coming from the bands Les Big Byrd, Pig Eyes, Nine, Nitad and Neu-Ronz. In 2018, they released their first album, Street Worms. Nils Hansson, a journalist at the newspaper Dagens Nyheter described the band favorably, praising their musical style, as well as their use of black humor and satire, and rated the album a five out of five. In 2019, the band won the Independent Music Companies Association (IMPALA) Album of the Year Award for Street Worms. The band's second album, Welfare Jazz, was released in January 2021. \n\n Lineup: Tubeway Army, The Jesus and Mary Chain, Chain and The Gang, DEVO, Goran Kajfes Subtropic Arkestra, Goran Kajfes, Roxy Music, Built To Spill, The Stooges, Waylon Jennings, Clap Your Hands Say Yeah, DAF, The Stooges, Broadcast, Container, Run The Jewels, Spacemen 3, Daniel Lanois, Anna Domino, Rocket From The Tombs, Esbjörn Svensson Trio, Missing Persons, Pere Ubu, Christian Scott aTunde Adjuah, Elena Pinderhughes, Tom Tom Club, 13th Floor Elevators, Sleaford Mods, John Coltrane, Art Ensemble Of Chicago, Pixies, Fire! Orchestra, Richard Hell, The Breeders, Daniel Ögren, Sam Rivers, Chris & Cosey, The Soft Boys, Hawkwind, Joni Mitchell",
  "artist": "Tubeway Army, The Jesus and Mary Chain, Chain and The Gang, DEVO, Goran Kajfes Subtropic Arkestra, Goran Kajfes, Roxy Music, Built To Spill, The Stooges, Waylon Jennings, Clap Your Hands Say Yeah, DAF, The Stooges, Broadcast, Container, Run The Jewels, Spacemen 3, Daniel Lanois, Anna Domino, Rocket From The Tombs, Esbjörn Svensson Trio, Missing Persons, Pere Ubu, Christian Scott aTunde Adjuah, Elena Pinderhughes, Tom Tom Club, 13th Floor Elevators, Sleaford Mods, John Coltrane, Art Ensemble Of Chicago, Pixies, Fire! Orchestra, Richard Hell, The Breeders, Daniel Ögren, Sam Rivers, Chris & Cosey, The Soft Boys, Hawkwind, Joni Mitchell",
  "length": "349118067"
}
