{
  "id": "all-my-favorite-songs-017-david-bowie",
  "title": "All My Favorite Songs 017 by David Bowie - 25 Favorite Albums",
  "timestamp": 1637926496,
  "webpage_url": "http://allmyfavoritesongs.com#017",
  "description": "David Robert Jones OAL (8 January 1947 – 10 January 2016), known professionally as David Bowie, was an English singer-songwriter and actor. A leading figure in the music industry, Bowie is regarded as one of the most influential musicians of the 20th century. He was acclaimed by critics and musicians, particularly for his innovative work during the 1970s. His career was marked by reinvention and visual presentation, and his music and stagecraft had a significant impact on popular music. \n\n In this episode we selected two tracks from each of the 25 records Bowie revealed were his favorite to Vanity Fair, for their November 2003 issue. \n\n Lineup:\n The Last Poets, Robert Wyatt, Little Richard, Steve Reich, The Velvet Underground, Nico, John Lee Hooker, Ray Koerner & Glover, James Brown, Linton Kwesi Johnson, The Red Flower Of Tachai Blossoms Everywhere, Daevid Allen, Scott Walker, Tom Dissevelt, Kid Baltan, The Incredible String Band, Tucker Zimmerman, Richard Strauss, Gundula Janowitz, Berliner Philharmoniker, Herbert von Karajan, Glenn Branca, Syd Barrett, George Crumb, Kronos Quartet, Toots & The Maytals, Harry Partch, John Stannard, Victoria Bond, Paul Bergen, Ensemble of Unique Instruments, Danlee Mitchell, Charles Mingus, Igor Stravinsky, Columbia Symphony Orchestra, The Fugs, Anatoly Lyadov, Florence Foster Jenkins, Cosme McMoon",
  "artist": "The Last Poets, Robert Wyatt, Little Richard, Steve Reich, The Velvet Underground, Nico, John Lee Hooker, Ray Koerner & Glover, James Brown, Linton Kwesi Johnson, The Red Flower Of Tachai Blossoms Everywhere, Daevid Allen, Scott Walker, Tom Dissevelt, Kid Baltan, The Incredible String Band, Tucker Zimmerman, Richard Strauss, Gundula Janowitz, Berliner Philharmoniker, Herbert von Karajan, Glenn Branca, Syd Barrett, George Crumb, Kronos Quartet, Toots & The Maytals, Harry Partch, John Stannard, Victoria Bond, Paul Bergen, Ensemble of Unique Instruments, Danlee Mitchell, Charles Mingus, Igor Stravinsky, Columbia Symphony Orchestra, The Fugs, Anatoly Lyadov, Florence Foster Jenkins, Cosme McMoon",
  "length": "281438811"
}
