{
  "id": "all-my-favorite-songs-045-the-chats",
  "title": "All My Favorite Songs 045 by The Chats - Rage Guest",
  "timestamp": 1672659296,
  "webpage_url": "https://allmyfavoritesongs.com#045",
  "description": "The Chats are an Australian punk rock band that formed in 2016 in the Sunshine Coast, Queensland. They describe their sound as 'shed rock'. The current band lineup is composed of guitarist Josh Hardy, drummer Matt Boggis, and bassist and vocalist Eamon Sandwith. The Chats make rambunctious old-school punk peppered with their cheeky, irreverent sense of humor. More interested in beer, smokes, and fast cars than the state of the world, the Chats follow in the tradition of Australian bands like the Cosmic Psychos, the Hard-Ons, and Dune Rats in cranking out raw, energetic punk with a smirking sense of fun and a regular-guy attitude.\n\n In this episode all songs selected by The Chats as guests for Australian TV show Rage, on September 14 2019. \n\n Lineup:\n The Stooges, Frenzal Rhomb, Tony Dork, BadDreems, Tenacious D, Sex Pistols, LES LULLIES, Boing Boing, The Clash, The Unknowns, Tommy and the Commies, The Cavemen., Cosmic Psychos, Drunk Mums, C.O.F.F.I.N, Flight To Dubai, Pist Idiots, IDLES, The Living Eyes, STORK, WOD, Peter Bibby, Clowns, The Clean, XTC, DEVO, Black Eyed Peas, ACDC, The Angels, Deep Purple, Bob Dylan, Cold Chisel, Midnight Oil, J.J. Cale, Daryl Hall & John Oates, Hello Sailor, The Bats, Mötley Crüe, Def Leppard, The Chats",
  "artist": "The Stooges, Frenzal Rhomb, Tony Dork, BadDreems, Tenacious D, Sex Pistols, LES LULLIES, Boing Boing, The Clash, The Unknowns, Tommy and the Commies, The Cavemen., Cosmic Psychos, Drunk Mums, C.O.F.F.I.N, Flight To Dubai, Pist Idiots, IDLES, The Living Eyes, STORK, WOD, Peter Bibby, Clowns, The Clean, XTC, DEVO, Black Eyed Peas, ACDC, The Angels, Deep Purple, Bob Dylan, Cold Chisel, Midnight Oil, J.J. Cale, Daryl Hall & John Oates, Hello Sailor, The Bats, Mötley Crüe, Def Leppard, The Chats",
  "length": "315134408"
}
