{
  "id": "all-my-favorite-songs-012-adam-yauch",
  "title": "All My Favorite Songs 012 by Adam Yauch - Mixtape",
  "timestamp": 1636284896,
  "webpage_url": "http://allmyfavoritesongs.com#012",
  "description": "Adam Nathaniel Yauch (August 5, 1964 – May 4, 2012), better known under the stage name MCA, was an American rapper, bass player, filmmaker and a founding member of the hip hop group Beastie Boys. Yauch co-founded the Beastie Boys with Mike 'Mike D' Diamond and Adam 'Ad-Rock' Horovitz in 1979. The band started off as a hardcore punk group, but soon began experimenting with hip-hop. The band broke huge with their first proper album, Licensed to Ill, in 1986; it was the biggest-selling rap album of the decade and the first to reach Number One on the Billboard chart. Further albums Paul’s Boutique, Check Your Head and Ill Communication cemented the Beasties as a true superstar act. Yauch also directed many of the Beastie Boys’ music videos under the pseudonym Nathaniel Hornblower. In 2002, he founded Oscilloscope Laboratories, an independent film production and distribution company based in New York City. As a Buddhist, he was involved in the Tibetan independence movement and organized the Tibetan Freedom Concert. He died in 2012 from parotid cancer. \n\n Lineup:\n Bad Brains, Stiff Little Fingers, Buzzcocks, Generation X, Public Image Ltd., Toots & The Maytals, Linton Kwesi Johnson, Bob Marley & The Wailers, Spoonie Gee, Run–D.M.C., Bob Dylan, Public Enemy, Jimi Hendrix, Jackson Browne, Back Door, The Beatles, Elis Regina, Antônio Carlos Jobim, Kanye West, Mos Def, Freeway, The Boys Choir Of Harlem, Phoenix, The Slits, Killing Joke, New Age Steppers, Young Marble Giants, Minor Threat, Cockney Rejects, Dr. Jeckyll & Mr. Hyde, Grandmaster Flash & The Furious Five, Jocelyn Brown, Frederick M.C. Count Linton, Malcolm McLaren, The Crusaders, Larry Carlton, Beanie Sigel, The Strokes, Arctic Monkeys",
  "artist": "Bad Brains, Stiff Little Fingers, Buzzcocks, Generation X, Public Image Ltd., Toots & The Maytals, Linton Kwesi Johnson, Bob Marley & The Wailers, Spoonie Gee, Run–D.M.C., Bob Dylan, Public Enemy, Jimi Hendrix, Jackson Browne, Back Door, The Beatles, Elis Regina, Antônio Carlos Jobim, Kanye West, Mos Def, Freeway, The Boys Choir Of Harlem, Phoenix, The Slits, Killing Joke, New Age Steppers, Young Marble Giants, Minor Threat, Cockney Rejects, Dr. Jeckyll & Mr. Hyde, Grandmaster Flash & The Furious Five, Jocelyn Brown, Frederick M.C. Count Linton, Malcolm McLaren, The Crusaders, Larry Carlton, Beanie Sigel, The Strokes, Arctic Monkeys",
  "length": "251628498"
}
