{
  "id": "all-my-favorite-songs-028-metz",
  "title": "All My Favorite Songs 028 by METZ - Nuggetz (part 2 of 2)",
  "timestamp": 1644924896,
  "webpage_url": "https://allmyfavoritesongs.com#028",
  "description": "METZ is a Canadian noise punk band formed in 2008 in Ottawa and currently based in Toronto. The band consists of guitarist and vocalist Alex Edkins, bassist Chris Slorach and drummer Hayden Menzies.\n\n In this episode, part two of a series of two, all songs selected by METZ and published as a playlist with a popular audio streaming provider (that shall remain unnamed), between Oct 2017 and Aug 2021. \n\n Lineup:\n Captain Beefheart & His Magic Band, Porter Wagoner, Josef K, XBXRX, Hoover, Les Savy Fav, Institute, Liars, Mekons, Wrangler Brutes, Head Wound City, A Place To Bury Strangers, U.S. Maple, Oneida, Metz, Freak Heat Waves, Mimico, Pere Ubu, Suicide, The Gories, Public Image Ltd., Cherubs, Plasmalab, Cindy Lee, Tales Of Terror, New Fries, Career Suicide, Wire, The Monorchid, Women, Mission Of Burma, Holy Fuck, Playthings, Wipers, Brian Eno, Tall Dwarfs, Uniform, Angel Olsen, Beak, Brainiac, Grouper, Unwound, Sic Alps, Swell Maps, MX-80, Television Personalities, Six Finger Satellite, Flesh World, Hot Snakes, Chad VanGaalen, Horse Lords, Spray Paint, Sparklehorse, Suburban Lawns, Protomartyr, SUUNS, Raspberry Bulbs, The Cleaners From Venus, Mudhoney, Neil Young, The Dream Syndicate, Elevator To Hell, Converge, Guided By Voices, Bitch Magnet, Lungfish",
  "artist": "Captain Beefheart & His Magic Band, Porter Wagoner, Josef K, XBXRX, Hoover, Les Savy Fav, Institute, Liars, Mekons, Wrangler Brutes, Head Wound City, A Place To Bury Strangers, U.S. Maple, Oneida, Metz, Freak Heat Waves, Mimico, Pere Ubu, Suicide, The Gories, Public Image Ltd., Cherubs, Plasmalab, Cindy Lee, Tales Of Terror, New Fries, Career Suicide, Wire, The Monorchid, Women, Mission Of Burma, Holy Fuck, Playthings, Wipers, Brian Eno, Tall Dwarfs, Uniform, Angel Olsen, Beak, Brainiac, Grouper, Unwound, Sic Alps, Swell Maps, MX-80, Television Personalities, Six Finger Satellite, Flesh World, Hot Snakes, Chad VanGaalen, Horse Lords, Spray Paint, Sparklehorse, Suburban Lawns, Protomartyr, SUUNS, Raspberry Bulbs, The Cleaners From Venus, Mudhoney, Neil Young, The Dream Syndicate, Elevator To Hell, Converge, Guided By Voices, Bitch Magnet, Lungfish",
  "length": "350976538"
}
